# TextRotate

## Description
Procedure TextRotate sets the angle of a new text object.

```pascal
PROCEDURE TextRotate(Rotation : REAL);
```

```python

def vs.TextRotate(Rotation):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|Rotation|REAL|Rotation angle, in degrees, for text.|

## Examples
```pascal
TextRotate(45);

TextOrigin(0&quot;,0&quot;);

CreateText('Rotated string');
```

## Version
Availability: from MiniCAD
## Category
* Objects - Text